# coding: utf-8

__author__ = 'bin wen'


RESULT_CODES = {
    100: u"请求非法",
    101: u"系统异常",
    102: u"数据已经存在",
    1002: u"请输入登录帐号或密码",
    1003: u"登录帐号或密码不正确",
    1004: u"无效登录帐户",
    1005: u"请输入旧密码或新密码",
    1006: u"旧密码不正确",
    2001: u"请选择对应的三级分类选项值",
    2002: u"分类名称不正确,请输入2-16位字母,数字,下划线或汉字组成",
    2003: u"分类未添加属性， 请先添加相应属性后再创建货品",
    3001: u"属性名称不正确,请输入1-20位字母,数字,下划线组成",
    3002: u"属性选项值不正确,请输入1-20位字母,数字,下划线组成",
    4000: u"商品编码重复",
    4001: u"没有找到对应的商品图片",
    4002: u"没有找到对应的角标图片",
    5001: u"退款金额超限",
    6001: u"取消退款条件不符合",
    6002: u"退款金额不能大于实际可退的金额",
    6003: u"签收退货时, 商品验收必选"
}
